benchmarks/output/20260816T134548Z/baseline-none-c64-run1.txt
Running 30s test @ http://bench:3000/baseline
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms    2.71ms  46.09ms   96.12%
    Req/Sec    32.69k     7.52k  190.72k    80.43%
  Latency Distribution
     50%  454.00us
     75%  583.00us
     90%    0.86ms
     99%   17.28ms
  3907277 requests in 30.10s, 238.48MB read
Requests/sec: 129805.69
Transfer/sec:      7.92MB
BENCHMARK_CSV,3907277,129805.69,454,2041,17284,0,0,0,0,0